; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph3 - mode
	infrared1 - mode
	spectrograph4 - mode
	image0 - mode
	spectrograph5 - mode
	infrared2 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph5)
	(supports instrument0 image0)
	(supports instrument0 spectrograph4)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star13)
)
(:goal (and
	(pointing satellite0 Phenomenon6)
	(have_image Phenomenon6 spectrograph4)
	(have_image Phenomenon6 thermograph3)
	(have_image Planet7 spectrograph4)
	(have_image Planet8 infrared2)
	(have_image Planet8 spectrograph5)
	(have_image Star9 spectrograph4)
	(have_image Star9 image0)
	(have_image Planet10 spectrograph4)
	(have_image Planet10 thermograph3)
	(have_image Planet11 spectrograph4)
	(have_image Planet11 thermograph3)
	(have_image Planet12 spectrograph4)
	(have_image Star13 infrared2)
	(have_image Star13 thermograph3)
	(have_image Phenomenon14 thermograph3)
	(have_image Phenomenon14 spectrograph4)
	(have_image Phenomenon15 spectrograph5)
	(have_image Phenomenon15 infrared1)
	(have_image Phenomenon16 spectrograph5)
	(have_image Phenomenon16 infrared2)
))

)

; plan
1. (turn_to satellite0 groundstation2 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 21
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 21
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 21
4. (turn_to satellite0 planet11 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet11)
   goals met: 0 of 21
5. (take_image satellite0 planet11 instrument0 thermograph3)
   added: (have_image planet11 thermograph3)
   goals met: 1 of 21
6. (take_image satellite0 planet11 instrument0 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 2 of 21
7. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 2 of 21
8. (take_image satellite0 planet10 instrument0 thermograph3)
   added: (have_image planet10 thermograph3)
   goals met: 3 of 21
9. (take_image satellite0 planet10 instrument0 spectrograph4)
   added: (have_image planet10 spectrograph4)
   goals met: 4 of 21
10. (turn_to satellite0 phenomenon16 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon16)
   goals met: 4 of 21
11. (take_image satellite0 phenomenon16 instrument0 spectrograph5)
   added: (have_image phenomenon16 spectrograph5)
   goals met: 5 of 21
12. (take_image satellite0 phenomenon16 instrument0 infrared2)
   added: (have_image phenomenon16 infrared2)
   goals met: 6 of 21
13. (turn_to satellite0 phenomenon15 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon15)
   goals met: 6 of 21
14. (take_image satellite0 phenomenon15 instrument0 spectrograph5)
   added: (have_image phenomenon15 spectrograph5)
   goals met: 7 of 21
15. (take_image satellite0 phenomenon15 instrument0 infrared1)
   added: (have_image phenomenon15 infrared1)
   goals met: 8 of 21
16. (turn_to satellite0 phenomenon14 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon14)
   goals met: 8 of 21
17. (take_image satellite0 phenomenon14 instrument0 thermograph3)
   added: (have_image phenomenon14 thermograph3)
   goals met: 9 of 21
18. (take_image satellite0 phenomenon14 instrument0 spectrograph4)
   added: (have_image phenomenon14 spectrograph4)
   goals met: 10 of 21
19. (turn_to satellite0 planet12 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet12)
   goals met: 10 of 21
20. (take_image satellite0 planet12 instrument0 spectrograph4)
   added: (have_image planet12 spectrograph4)
   goals met: 11 of 21
21. (turn_to satellite0 planet7 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet7)
   goals met: 11 of 21
22. (take_image satellite0 planet7 instrument0 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 12 of 21
23. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 12 of 21
24. (take_image satellite0 planet8 instrument0 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 13 of 21
25. (take_image satellite0 planet8 instrument0 spectrograph5)
   added: (have_image planet8 spectrograph5)
   goals met: 14 of 21
26. (turn_to satellite0 star13 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star13)
   goals met: 14 of 21
27. (take_image satellite0 star13 instrument0 infrared2)
   added: (have_image star13 infrared2)
   goals met: 15 of 21
28. (take_image satellite0 star13 instrument0 thermograph3)
   added: (have_image star13 thermograph3)
   goals met: 16 of 21
29. (turn_to satellite0 star9 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star9)
   goals met: 16 of 21
30. (take_image satellite0 star9 instrument0 image0)
   added: (have_image star9 image0)
   goals met: 17 of 21
31. (take_image satellite0 star9 instrument0 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 18 of 21
32. (turn_to satellite0 phenomenon6 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon6)
   goals met: 19 of 21
33. (take_image satellite0 phenomenon6 instrument0 spectrograph4)
   added: (have_image phenomenon6 spectrograph4)
   goals met: 20 of 21
34. (take_image satellite0 phenomenon6 instrument0 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 21 of 21
